exosite-garage/CC3200CloudDemo/main.c
    }

    //No Mode Change Required
    if(lRetVal == ROLE_AP)
    {
        //waiting for the AP to acquire IP address from Internal DHCP Server
        // If the device is in AP mode, we need to wait for this event 
        // before doing anything 
        while(!IS_IP_ACQUIRED(g_ulStatus))
        {
        #ifndef SL_PLATFORM_MULTI_THREADED
            _SlNonOsMainLoopTask(); 
        #endif
        }
        //Stop Internal HTTP Server
        lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

        //Start Internal HTTP Server
        lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

       char cCount=0;
       
       //Blink LED 3 times to Indicate AP Mode
       for(cCount=0;cCount<3;cCount++)
       {
           //Turn RED LED On
           GPIO_IF_LedOn(MCU_RED_LED_GPIO);
           osi_Sleep(400);
           
           //Turn RED LED Off
           GPIO_IF_LedOff(MCU_RED_LED_GPIO);
           osi_Sleep(400);
       }

       char ssid[32];
	   unsigned short len = 32;
	   unsigned short config_opt = WLAN_AP_OPT_SSID;
	   sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt , &len, (unsigned char* )ssid);
	   UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r",ssid);
    }
    else
    {
        //Stop Internal HTTP Server
        lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

        //Start Internal HTTP Server
        lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

    	//waiting for the device to Auto Connect
        while(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT &&
            ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))) 
        {
            //Turn RED LED On
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            //Turn RED LED Off
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            uiConnectTimeoutCnt++;
        }
        //Couldn't connect Using Auto Profile
        if(uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT)
        {
            //Blink Red LED to Indicate Connection Error
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            
            CLR_STATUS_BIT_ALL(g_ulStatus);

            //Connect Using Smart Config
            lRetVal = SmartConfigConnect();
            ASSERT_ON_ERROR(lRetVal);

            //Waiting for the device to Auto Connect
            while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
            {
                MAP_UtilsDelay(500);              
            }
    }
    //Turn RED LED Off
    GPIO_IF_LedOff(MCU_RED_LED_GPIO);

    g_iInternetAccess = ConnectionTest();

    }
    return SUCCESS;
}


//****************************************************************************
//
//!    \brief Read Force AP GPIO and Configure Mode - 1(Access Point Mode)
//!                                                  - 0 (Station Mode)
//!
//! \return                        None
//
//****************************************************************************
static void ReadDeviceConfiguration()
{
    unsigned int uiGPIOPort;
    unsigned char pucGPIOPin;
    unsigned char ucPinValue;
        
    //Read GPIO
    GPIO_IF_GetPortNPin(SH_GPIO_3,&uiGPIOPort,&pucGPIOPin);
    ucPinValue = GPIO_IF_Get(SH_GPIO_3,uiGPIOPort,pucGPIOPin);
        
    //If Connected to VCC, Mode is AP
    if(ucPinValue == 1)
    {
        //AP Mode
        g_uiDeviceModeConfig = ROLE_AP;
    }
    else
    {
        //STA Mode
        g_uiDeviceModeConfig = ROLE_STA;
    }

}


//*****************************************************************************
//
//! AccSample
//!
//!    @brief  Read Accelerometer Data from Sensor to Globals
//!
//!
//!     @return none
//!
//!
//
//*****************************************************************************
void AccSample()
{
    signed char accX,accY,accZ;
    int iRet = -1;
    unsigned long critKey;

    critKey = osi_EnterCritical();

    iRet = BMA222ReadNew(&accX, &accY, &accZ);
    if(iRet)
    {
        //In case of error/ No New Data return
        return;
    }


    g_accXIntervalSum += accX;
    g_accYIntervalSum += accY;
    g_accZIntervalSum += accZ;

    g_accSampleCount++;
    osi_ExitCritical(critKey);

}


//*****************************************************************************
//
//! ReadAccSensor
//!
//!    @brief  Calculate Averages of Accelerometer Globals
//!
//!
//!     @return none
//!
//!
//
//*****************************************************************************
void SetAccAvg()
{
	unsigned long critKey;

    critKey = osi_EnterCritical();
    g_accXAvg = g_accXIntervalSum / g_accSampleCount;
    g_accYAvg = g_accYIntervalSum / g_accSampleCount;
    g_accZAvg = g_accZIntervalSum / g_accSampleCount;
    g_accTotalAvg = (g_accZIntervalSum + g_accYIntervalSum + g_accXIntervalSum ) /
		(g_accSampleCount * 3);

    g_accXIntervalSum = 0;
    g_accYIntervalSum = 0;
    g_accZIntervalSum = 0;
    g_accSampleCount = 0;
    osi_ExitCritical(critKey);

}

//****************************************************************************
//
//!    \brief Exosite Application Main Task - Initializes SimpleLink Driver
//!                                           and Handles HTTP Requests
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void ExositeTask(void *pvParameters)
{
    long   ret = -1;
    unsigned long long retry_delay = 100;
    unsigned long long counter = 0;
    char buf[1024];
    EXO_STATE state = EXO_STATE_NOT_COMPLETE;

    //Read Device Mode Configuration
    ReadDeviceConfiguration();

    //Connect to Network
    ret = ConnectToNetwork();
    if(ret < 0)
    {
        ERR_PRINT(ret);
        LOOP_FOREVER();
    }

    // Wait here if we're in AP Mode
    while(g_uiDeviceModeConfig != ROLE_STA){
        osi_Sleep(1000);
    }

    //Handle Async Events
    while(1)
    {
    	//TODO: Wrap all Exosite calls in a check to see if we're connected.
        while(state != EXO_STATE_INIT_COMPLETE){
    		UART_PRINT("[EXO] Exosite Init\r\n");
    		state = exosite_init("texasinstruments","cc3200lp_v1");
    		if(state == EXO_STATE_INIT_COMPLETE){
    			UART_PRINT("[EXO] Activated, Ready to Go\r\n");
    		}else if(state == EXO_STATE_INIT_ERROR){
    			UART_PRINT("[EXO] Error Activating on Exosite (Add to Account or Re-enable for Activation)\r\n");
    			retry_delay *= 2;
    	        osi_Sleep(retry_delay);
    		}else if(state == EXO_STATE_CONNECTION_ERROR){
    			UART_PRINT("[EXO] Error Connecting to Exosite, Check Your Connection\r\n");
    			//retry_delay *= 2;
    	        osi_Sleep(retry_delay);
    		}else if(state == EXO_STATE_NO_RESPONSE){
    			UART_PRINT("[EXO] We connected, but timed-out waiting for a response. Try again.\r\n");
    			retry_delay *= 2;
    	        osi_Sleep(retry_delay);
    		}else if(state == EXO_STATE_DEVICE_NOT_ENABLED){
    			UART_PRINT("[EXO] Couldn't Activate on Exosite (Add to Account or Re-enable for Activation)\r\n");
    			retry_delay *= 2;
    	        osi_Sleep(retry_delay);
    		}else if(state == EXO_STATE_R_W_ERROR){
    			UART_PRINT("[EXO] Read/Write Error\r\n");
    			retry_delay *= 2;
    	        osi_Sleep(retry_delay);
    		}else{
    			UART_PRINT("[EXO] Unknown State in Init");
    			return;
    		}
        }


        UART_PRINT("[EXO] Writing Values...");

    	AccSample(); // Just do a single reading for now. TODO: Make Async.
        SetAccAvg();

        float sensorTemp;
        TMP006DrvGetTemp(&sensorTemp);
        snprintf(buf, 1023, "ontime=%llu&acc=%.0f&accX=%.0f&accY=%.0f&accZ=%.0f&sensortemp=%.2f&usrsw=%llu",
                g_uptimeSec,
                g_accTotalAvg,
                g_accXAvg,
                g_accYAvg,
                g_accZAvg,
                sensorTemp,
                g_SW2Counter);
        ret = exosite_write(buf,strlen(buf));
        if(ret == 0){
        	UART_PRINT("OK\r\n");
        	retry_delay = 1000;
        }else{
        	UART_PRINT("ERROR\r\n");
        	retry_delay *= 2;
        	state = EXO_STATE_NOT_COMPLETE;
        	ERR_PRINT(ret);
        }

        //LED Actions for OOB Code
        if(g_ucLEDStatus == LED_ON)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
        }
        if(g_ucLEDStatus == LED_OFF)
        {
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
        }
        if(g_ucLEDStatus==LED_BLINK)
        {
        	GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
        }

        // Limit Retry Delay to 10 Seconds During Development
        if(retry_delay > 10000)
        	retry_delay = 10000;

